MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526T9AGFL/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE9M : 4;
			unsigned short POE9M2 : 4;
			unsigned short PIE8 : 1;
			unsigned short POE9E : 1;
			unsigned short  : 2;
			unsigned short POE9F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE9F : 1;
			unsigned short  : 2;
			unsigned short POE9E : 1;
			unsigned short PIE8 : 1;
			unsigned short POE9M2 : 4;
			unsigned short POE9M : 4;
#endif
	} BIT;
	} ICSR8;
	char           wk3[4];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE4 : 1;
			unsigned short OCE4 : 1;
			unsigned short  : 5;
			unsigned short OSF4 : 1;
#else
			unsigned short OSF4 : 1;
			unsigned short  : 5;
			unsigned short OCE4 : 1;
			unsigned short OIE4 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE5 : 1;
			unsigned short OCE5 : 1;
			unsigned short  : 5;
			unsigned short OSF5 : 1;
#else
			unsigned short OSF5 : 1;
			unsigned short  : 5;
			unsigned short OCE5 : 1;
			unsigned short OIE5 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short  : 5;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 5;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT67ZE : 1;
			unsigned short IC1ADDMT67ZE : 1;
			unsigned short IC2ADDMT67ZE : 1;
			unsigned short IC3ADDMT67ZE : 1;
			unsigned short IC4ADDMT67ZE : 1;
			unsigned short IC5ADDMT67ZE : 1;
			unsigned short IC6ADDMT67ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDMT67ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDMT67ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDMT67ZE : 1;
			unsigned short IC5ADDMT67ZE : 1;
			unsigned short IC4ADDMT67ZE : 1;
			unsigned short IC3ADDMT67ZE : 1;
			unsigned short IC2ADDMT67ZE : 1;
			unsigned short IC1ADDMT67ZE : 1;
			unsigned short CMADDMT67ZE : 1;
#endif
	} BIT;
	} POECR4B;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT23ZE : 1;
			unsigned short IC1ADDGPT23ZE : 1;
			unsigned short IC2ADDGPT23ZE : 1;
			unsigned short IC3ADDGPT23ZE : 1;
			unsigned short IC4ADDGPT23ZE : 1;
			unsigned short IC5ADDGPT23ZE : 1;
			unsigned short IC6ADDGPT23ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT23ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDGPT23ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT23ZE : 1;
			unsigned short IC5ADDGPT23ZE : 1;
			unsigned short IC4ADDGPT23ZE : 1;
			unsigned short IC3ADDGPT23ZE : 1;
			unsigned short IC2ADDGPT23ZE : 1;
			unsigned short IC1ADDGPT23ZE : 1;
			unsigned short CMADDGPT23ZE : 1;
#endif
	} BIT;
	} POECR6B;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT02ZE : 1;
			unsigned short IC1ADDGPT02ZE : 1;
			unsigned short IC2ADDGPT02ZE : 1;
			unsigned short IC3ADDGPT02ZE : 1;
			unsigned short IC4ADDGPT02ZE : 1;
			unsigned short IC5ADDGPT02ZE : 1;
			unsigned short IC6ADDGPT02ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT02ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDGPT02ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT02ZE : 1;
			unsigned short IC5ADDGPT02ZE : 1;
			unsigned short IC4ADDGPT02ZE : 1;
			unsigned short IC3ADDGPT02ZE : 1;
			unsigned short IC2ADDGPT02ZE : 1;
			unsigned short IC1ADDGPT02ZE : 1;
			unsigned short CMADDGPT02ZE : 1;
#endif
	} BIT;
	} POECR9;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT46ZE : 1;
			unsigned short IC1ADDGPT46ZE : 1;
			unsigned short IC2ADDGPT46ZE : 1;
			unsigned short IC3ADDGPT46ZE : 1;
			unsigned short IC4ADDGPT46ZE : 1;
			unsigned short IC5ADDGPT46ZE : 1;
			unsigned short IC6ADDGPT46ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT46ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDGPT46ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT46ZE : 1;
			unsigned short IC5ADDGPT46ZE : 1;
			unsigned short IC4ADDGPT46ZE : 1;
			unsigned short IC3ADDGPT46ZE : 1;
			unsigned short IC2ADDGPT46ZE : 1;
			unsigned short IC1ADDGPT46ZE : 1;
			unsigned short CMADDGPT46ZE : 1;
#endif
	} BIT;
	} POECR10;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT79ZE : 1;
			unsigned short IC1ADDGPT79ZE : 1;
			unsigned short IC2ADDGPT79ZE : 1;
			unsigned short IC3ADDGPT79ZE : 1;
			unsigned short IC4ADDGPT79ZE : 1;
			unsigned short IC5ADDGPT79ZE : 1;
			unsigned short IC6ADDGPT79ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT79ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDGPT79ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT79ZE : 1;
			unsigned short IC5ADDGPT79ZE : 1;
			unsigned short IC4ADDGPT79ZE : 1;
			unsigned short IC3ADDGPT79ZE : 1;
			unsigned short IC2ADDGPT79ZE : 1;
			unsigned short IC1ADDGPT79ZE : 1;
			unsigned short CMADDGPT79ZE : 1;
#endif
	} BIT;
	} POECR11;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX6;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX7;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX8;
	char           wk4[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE0MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE0MS : 6;
#endif
	} BIT;
	} IMCR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE4MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE4MS : 6;
#endif
	} BIT;
	} IMCR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE8MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE8MS : 6;
#endif
	} BIT;
	} IMCR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE10MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE10MS : 6;
#endif
	} BIT;
	} IMCR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0ASEL : 4;
			unsigned char M0BSEL : 4;
#else
			unsigned char M0BSEL : 4;
			unsigned char M0ASEL : 4;
#endif
	} BIT;
	} M0SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M0CSEL : 4;
			unsigned char M0DSEL : 4;
#else
			unsigned char M0DSEL : 4;
			unsigned char M0CSEL : 4;
#endif
	} BIT;
	} M0SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M3BSEL : 4;
			unsigned char M3DSEL : 4;
#else
			unsigned char M3DSEL : 4;
			unsigned char M3BSEL : 4;
#endif
	} BIT;
	} M3SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4ASEL : 4;
			unsigned char M4CSEL : 4;
#else
			unsigned char M4CSEL : 4;
			unsigned char M4ASEL : 4;
#endif
	} BIT;
	} M4SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M4BSEL : 4;
			unsigned char M4DSEL : 4;
#else
			unsigned char M4DSEL : 4;
			unsigned char M4BSEL : 4;
#endif
	} BIT;
	} M4SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M6BSEL : 4;
			unsigned char M6DSEL : 4;
#else
			unsigned char M6DSEL : 4;
			unsigned char M6BSEL : 4;
#endif
	} BIT;
	} M6SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M7ASEL : 4;
			unsigned char M7CSEL : 4;
#else
			unsigned char M7CSEL : 4;
			unsigned char M7ASEL : 4;
#endif
	} BIT;
	} M7SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M7BSEL : 4;
			unsigned char M7DSEL : 4;
#else
			unsigned char M7DSEL : 4;
			unsigned char M7BSEL : 4;
#endif
	} BIT;
	} M7SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M9ASEL : 4;
			unsigned char M9BSEL : 4;
#else
			unsigned char M9BSEL : 4;
			unsigned char M9ASEL : 4;
#endif
	} BIT;
	} M9SELR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char M9CSEL : 4;
			unsigned char M9DSEL : 4;
#else
			unsigned char M9DSEL : 4;
			unsigned char M9CSEL : 4;
#endif
	} BIT;
	} M9SELR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G0ASEL : 4;
			unsigned char G0BSEL : 4;
#else
			unsigned char G0BSEL : 4;
			unsigned char G0ASEL : 4;
#endif
	} BIT;
	} G0SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G1ASEL : 4;
			unsigned char G1BSEL : 4;
#else
			unsigned char G1BSEL : 4;
			unsigned char G1ASEL : 4;
#endif
	} BIT;
	} G1SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G2ASEL : 4;
			unsigned char G2BSEL : 4;
#else
			unsigned char G2BSEL : 4;
			unsigned char G2ASEL : 4;
#endif
	} BIT;
	} G2SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G3ASEL : 4;
			unsigned char G3BSEL : 4;
#else
			unsigned char G3BSEL : 4;
			unsigned char G3ASEL : 4;
#endif
	} BIT;
	} G3SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G4ASEL : 4;
			unsigned char G4BSEL : 4;
#else
			unsigned char G4BSEL : 4;
			unsigned char G4ASEL : 4;
#endif
	} BIT;
	} G4SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G5ASEL : 4;
			unsigned char G5BSEL : 4;
#else
			unsigned char G5BSEL : 4;
			unsigned char G5ASEL : 4;
#endif
	} BIT;
	} G5SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G6ASEL : 4;
			unsigned char G6BSEL : 4;
#else
			unsigned char G6BSEL : 4;
			unsigned char G6ASEL : 4;
#endif
	} BIT;
	} G6SELR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char G7ASEL : 4;
			unsigned char G7BSEL : 4;
#else
			unsigned char G7BSEL : 4;
			unsigned char G7ASEL : 4;
#endif
	} BIT;
	} G7SELR;
	char           wk5[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE11MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE11MS : 6;
#endif
	} BIT;
	} IMCR4;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE12MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE12MS : 6;
#endif
	} BIT;
	} IMCR5;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POE9MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POE9MS : 6;
#endif
	} BIT;
	} IMCR6;
	char           wk6[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP0MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP0MS : 6;
#endif
	} BIT;
	} IMCR9;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP1MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP1MS : 6;
#endif
	} BIT;
	} IMCR10;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP2MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP2MS : 6;
#endif
	} BIT;
	} IMCR11;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP3MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP3MS : 6;
#endif
	} BIT;
	} IMCR12;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP4MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP4MS : 6;
#endif
	} BIT;
	} IMCR13;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMP5MS : 6;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char CMP5MS : 6;
#endif
	} BIT;
	} IMCR14;
} st_poe_t;

typedef struct st_poeg {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 7;
			unsigned long NFPSC : 1;
			unsigned long ELSEL : 1;
			unsigned long NFSN : 2;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long NFSN : 2;
			unsigned long ELSEL : 1;
			unsigned long NFPSC : 1;
			unsigned long  : 7;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGA;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSEL : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long MSEL : 5;
#endif
	} BIT;
	} POEGICRA;
	char           wk0[56];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPA;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 2;
			unsigned short MSEL : 5;
#else
			unsigned short MSEL : 5;
			unsigned short  : 2;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRA;
	char           wk2[186];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 7;
			unsigned long NFPSC : 1;
			unsigned long ELSEL : 1;
			unsigned long NFSN : 2;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long NFSN : 2;
			unsigned long ELSEL : 1;
			unsigned long NFPSC : 1;
			unsigned long  : 7;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGB;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSEL : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long MSEL : 5;
#endif
	} BIT;
	} POEGICRB;
	char           wk3[56];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPB;
	char           wk4[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 2;
			unsigned short MSEL : 5;
#else
			unsigned short MSEL : 5;
			unsigned short  : 2;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRB;
	char           wk5[186];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 7;
			unsigned long NFPSC : 1;
			unsigned long ELSEL : 1;
			unsigned long NFSN : 2;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long NFSN : 2;
			unsigned long ELSEL : 1;
			unsigned long NFPSC : 1;
			unsigned long  : 7;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGC;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSEL : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long MSEL : 5;
#endif
	} BIT;
	} POEGICRC;
	char           wk6[56];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPC;
	char           wk7[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 2;
			unsigned short MSEL : 5;
#else
			unsigned short MSEL : 5;
			unsigned short  : 2;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRC;
	char           wk8[186];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PIDF : 1;
			unsigned long IOCF : 1;
			unsigned long OSTPF : 1;
			unsigned long SSF : 1;
			unsigned long PIDE : 1;
			unsigned long IOCE : 1;
			unsigned long OSTPE : 1;
			unsigned long  : 1;
			unsigned long CDRE0 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE5 : 1;
			unsigned long  : 2;
			unsigned long ST : 1;
			unsigned long  : 7;
			unsigned long NFPSC : 1;
			unsigned long ELSEL : 1;
			unsigned long NFSN : 2;
			unsigned long INV : 1;
			unsigned long NFEN : 1;
			unsigned long NFCS : 2;
#else
			unsigned long NFCS : 2;
			unsigned long NFEN : 1;
			unsigned long INV : 1;
			unsigned long NFSN : 2;
			unsigned long ELSEL : 1;
			unsigned long NFPSC : 1;
			unsigned long  : 7;
			unsigned long ST : 1;
			unsigned long  : 2;
			unsigned long CDRE5 : 1;
			unsigned long CDRE4 : 1;
			unsigned long CDRE3 : 1;
			unsigned long CDRE2 : 1;
			unsigned long CDRE1 : 1;
			unsigned long CDRE0 : 1;
			unsigned long  : 1;
			unsigned long OSTPE : 1;
			unsigned long IOCE : 1;
			unsigned long PIDE : 1;
			unsigned long SSF : 1;
			unsigned long OSTPF : 1;
			unsigned long IOCF : 1;
			unsigned long PIDF : 1;
#endif
	} BIT;
	} POEGGD;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSEL : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long MSEL : 5;
#endif
	} BIT;
	} POEGICRD;
	char           wk9[56];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short WP : 1;
			unsigned short  : 7;
			unsigned short PRKEY : 8;
#else
			unsigned short PRKEY : 8;
			unsigned short  : 7;
			unsigned short WP : 1;
#endif
	} BIT;
	} GTONCWPD;
	char           wk10[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short NE : 1;
			unsigned short  : 3;
			unsigned short NFS : 4;
			unsigned short NFV : 1;
			unsigned short  : 2;
			unsigned short MSEL : 5;
#else
			unsigned short MSEL : 5;
			unsigned short  : 2;
			unsigned short NFV : 1;
			unsigned short NFS : 4;
			unsigned short  : 3;
			unsigned short NE : 1;
#endif
	} BIT;
	} GTONCCRD;
} st_poeg_t;

typedef struct st_port {
	union {
		unsigned short WORD;
		struct {
			
